Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_team.this["rust-libp2p Maintainers"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Trusted reviewers for merging into rust-libp2p repositories."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "rust-libp2p Maintainers"
      + node_id                   = (known after apply)
      + parent_team_id            = 2457482
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["Repos - Rust:jxs"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "2457482"
      + username = "jxs"
    }

  # github_team_membership.this["rust-libp2p Maintainers:BigLep"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "BigLep"
    }

  # github_team_membership.this["rust-libp2p Maintainers:elenaf9"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "elenaf9"
    }

  # github_team_membership.this["rust-libp2p Maintainers:jxs"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "jxs"
    }

  # github_team_membership.this["rust-libp2p Maintainers:mxinden"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "mxinden"
    }

  # github_team_membership.this["rust-libp2p Maintainers:thomaseizinger"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "thomaseizinger"
    }

  # github_team_repository.this["rust-libp2p Maintainers:rust-libp2p"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "rust-libp2p"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["rust-libp2p Maintainers:rust-yamux"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "rust-yamux"
      + team_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->